API/Flight_WSDL/Report/Res3/Report/Data/Step4.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">CreateFlightOrder</td><td class="value col-head-style">StServiceCallActivity7</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity7_InputXml_1d0a7352-effb-4a53-9e6c-809fce32ce43.xml\', \'Data/StServiceCallActivity7_InputXml_1d0a7352-effb-4a53-9e6c-809fce32ce43-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;FlightOrder&gt;\r\n        &lt;Class&gt;Economy&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Bob Smith&lt;/CustomerName&gt;\r\n        &lt;DepartureDate&gt;2025-12-31T00:00:00+00:00&lt;/DepartureDate&gt;\r\n        &lt;FlightNumber&gt;1492&lt;/FlightNumber&gt;\r\n        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;\r\n      &lt;/FlightOrder&gt;\r\n    &lt;/CreateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">CreateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity7_Full_request_84d36274-c085-4e42-af34-1f45d33b592c.xml\', \'Data/StServiceCallActivity7_Full_request_84d36274-c085-4e42-af34-1f45d33b592c-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	414\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	342\nContent-Type:	text/xml; charset=utf-8\nDate:	Mon, 12 May 2025 14:00:32 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;OrderNumber&gt;94&lt;/OrderNumber&gt;&lt;TotalPrice&gt;874.800049&lt;/TotalPrice&gt;&lt;/CreateFlightOrderResult&gt;&lt;/CreateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity7_OutputXml_cf39930d-34bc-4d52-ad13-72f42aca6b8a.xml\', \'Data/StServiceCallActivity7_OutputXml_cf39930d-34bc-4d52-ad13-72f42aca6b8a-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;OrderNumber&gt;94&lt;/OrderNumber&gt;\r\n        &lt;TotalPrice&gt;874.800049&lt;/TotalPrice&gt;\r\n      &lt;/CreateFlightOrderResult&gt;\r\n    &lt;/CreateFlightOrderResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}